{"body":"N? Leo Manu - Heavenly Voices - Video Archive - 2014       N? Leo Manu is part of ?Ike Hana No?eau, a series of Hawaiian cultural programs sponsored by Hawai?i Volcanoes National Park and the Hawai?i Pacific Parks Association.         December 17, 2014 - Enjoy island music with Kenneth Makuak?ne Join Kenneth Makuak?ne, twelve-time N? Hoku Hanohano award-winning singer, song writer, and producer, as he shares original songs from his latest albums, The Dash, White Bath Tub, his first solo album, Makuak?ne, and other award-winning compositions.         October 15, 2014 - H?lau Hula Kalehuaki\u0027eki\u0027eika\u0027iu ma K?lauea Under the direction of kumu hula Ab Kawainohoikala\u0027i Valencia, follows the traditions of his kumu, Aunty Mae Kam?malu Klein of Kane\u0027ohe, O\u0027ahu. Their hula genealogy descends from Maiki Aiu Lake of Honolulu, O\u0027ahu, Lokalia Montgomery of Kapahulu, O\u0027ahu and Keahi Luahine of the island of Kaua\u0027i.         September 17, 2014 - Enjoy an evening of Hawaiian music  Listen to the sweet voice of Kai Ho‘opi‘i sharing the music of his ‘ohana from Kahakuloa, Maui. Kai is an Aloha Festivals Hawaiian Falsetto Singing Contest winner.          August 20, 2014 - Haunani\u0027s Aloha Expressions Enjoy an evening of Hawaiian music and hula with Haunani\u0027s Aloha Expressions         June 18, 2014 - H?lau Ulumamo o Hilo Palik? E Komo Mai . . . Come and enjoy an evening of hula with H?lau Ulumamo o Hilo Palik?, under the direction of Kumu Hula Mamo Brown.              May 21, 2014 - Mark Yamanaka Join Mark Yamanaka, a four-time, N? H?k? Hanohano award-winning singer and song writer as he shares original songs from his debut CD, \"Lei Pua Kenikeni\".         March 19, 2014 - Ben Ka‘ili  Hawaiian musician Ben Ka\u0027ili has dedicated his life to playing and promoting Hawaiian music. He has shared Hawaiian music at festivals, including Hawai\u0027i Volcanoes National Park\u0027s 33rd annual cultural festival last July.         February 19, 2014 - Russell Jay Keakealani Mauga In 1996, Russell recorded his first solo album under Shell Records entitled \"He Kakahiaka Nani E (A Beautiful Morning)\", which has been praised for it\u0027s vibrant Big Island styling of slack key, and its fresh interpretation of pop covers. It was one the years best Contemporary Hawaiian albums. Russell continues to give audiences a personal experience with the true aloha spirit.          January 15, 2014 - Enjoy an evening of Hawaiian music  Listen to the sweet voice of Kai Ho‘opi‘i sharing the music of his ‘ohana from Kahakuloa, Maui. Kai is an Aloha Festivals Hawaiian Falsetto Singing Contest winner.","title":"Hawai\u0027i Volcanoes National Park: 2014","url":"https://www.nps.gov/havo/learn/photosmultimedia/na-leo-manu-2014.htm"}