{"body":"Explore This Park    Learn About the Park     Nature     Animals               Animals       Information available: Hawaiian petrel, ?ua?u Hawaiian goose, n?n?       ?Ua?u at nesting burrow, 9000 ft. elevation, Haleakal?, Maui, Hawaii NPS Haleakal? National Park         Hawaiian Petrel - ?Ua?u The Hawaiian Petrel, also known by its Hawaiian name ?ua?u (pronounced oo-A-oo) is an endangered species and its largest known nesting colony is located at the top of Mount Haleakal?. For more information on the Hawaiian Petrel, click the link below for a PDF document. Hawaiian Petrel Fact Sheet Save Our Seabirds ?Ua?u are migratory seabirds. They fly over land at night and are believed to navigate by stars. These, and other seabirds that fly at night, sometimes become confused by lights. The seabirds fly around the lights, become tired and fall to the ground. Here\u0027s what to do if you find a grounded seabird.  Quietly approach the bird and gently pick it up with a cloth or hat. Be careful, the bird may bite.  Place it in a covered, well-ventilated box and keep it in a cool and shady place.  Do not give it any food or water.  Immediately call 1-877-428-6911.  Do not release the seabird. It is important that trained wildlife specialists inspect the bird for injuries.  Click on the link below to see a brochure on helping these grounded seabirds. Seabird Grounding Brochure       Family of endangered n?n? at Haleakal? National Park. NPS-Haleakal? National Park       Hawaiian Goose - N?n? The Hawaiian Goose, also known by it\u0027s Hawaiian name n?n? (pronounced nay-nay) is another endangered species that nests at Haleakal?. For more information on n?n? click on the link below. N?n? Fact Sheet N?n? In Your Neighborhood N?n? are flying around neighborhoods on the islands of Maui and Moloka\u0027i. If you see a n?n?:  Keep them wild. Do not give them any food or water.  Give them space. Getting too close can disturb the n?n?. If the birds move when you move, you are too close.  Keep them safe. Even the most trained pets can disturb n?n?. Please keep your pets away from these birds. Take unwanted pets to the local humane society.  Contact Wildlife Officials. Maui   984-8100 Moloka\u0027i 553-1746  For more information, click on the link below. N?n? Brochure Adopt A N?n? Want to help protect these endangered species? You can Adopt-A-N?n? through the Friends of Haleakal? National Park, Inc. All proceeds go directly to protecting and managing endangered species. For more information go to www.fhnp.org        The ?I?iwi, one of the most conspicuous of the park\u0027s honeycreepers Paul Banko  Honeycreepers Hawai?i\u0027s renowned honeycreeper family of birds, all closely related, have evolved into strikingly different species. Click here for more information.","title":"Haleakal? National Park: Animals","url":"https://www.nps.gov/hale/learn/nature/animals.htm"}