{"body":"N? Leo Manu - Heavenly Voices - Video Archive - 2011       N? Leo Manu is part of ?Ike Hana No?eau, a series of Hawaiian cultural programs sponsored by Hawai?i Volcanoes National Park and the Hawai?i Pacific Parks Association.           December 21, 2011 - Haunani\u0027s Aloha Expressions Haunani\u0027s Aloha Expressions is comprised of an all Hawaiian performing group of k?ne and w?hine k?puna, elders ranging in ages from 70-90 years old. length - 01:15:42            October 19, 2011 - Lono Kanaka?ole Trio Join Lono Kanaka?ole, Chrisy Lassiter and Kivin Kalauli for a delightful blend of traditional Hawaiian and hula music. length - 01:22:09            August 17, 2011 - K?hei Nahale-? Join singer, songwriter and kumu, K?hei Nahale-? for an evening of Hawaiian music and story telling. length - 01:24:47            July 20, 2011 - Rupert Tripp Come and enjoy an evening of music with N? H?k? Hanohano Award winner, singer, song writer and Praise and Worship leader Rupert Tripp Jr. as he plays from his CD releases and some of his favorite artists. His CD\u0027s will be available for purchase. length - 01:14:34            May 18, 2011 - H?lau Hula Kalehuaki?eki?eika?iu at K?lauea Come and witness a small portion of the traditions of H?lau Hula Kalehuaki?eki?eika?iu ma K?lauea that has been handed down through the generations, that connects us back to our past and pays homage to those who stand before us. length - 01:11:01            April 28 \u0026 29 2011 - Free Island Music with Kenneth Makuak?ne In celebration of Merrie Monarch, come and enjoy FREE island music with Kenneth Makuak?ne. length - 01:43:28            March 16, 2011 - Listen to the Sweet Voice of Kai Ho?opi?i Sharing the music of his ?ohana from Kahakuloa, Maui length - 01:18:38            February 16 2011 - Listen to the Sounds of Lito Arkangel Enjoy an evening of Hawaiian music. Experience the beautiful music of solo artist Lito Arkangel. length - 01:24:25            January 19, 2011 - Hawaiian Music and Dance Come and enjoy an evening of Hawaiian music and dance with Kumu Meleana Ulrich-Manuel and Halau ke ?Olu Makani O Mauna Loa. length - 01:10:07            November 17 2010 - Island Music with Kenneth Makuak?ne Join Kenneth Makuakane, a twelve time Na Hoku Hanohano award winning singer, song writer and producer, as he shares original songs from his latest albums, The dash, White Bath Tub, his first solo album, Makuak?ne and other award winning compositions. length - 01:28:31","title":"Hawai\u0027i Volcanoes National Park: 2011","url":"https://www.nps.gov/havo/learn/photosmultimedia/na-leo-manu-2011.htm"}