{"body":"Explore This Park    Learn About the Park     Photos \u0026 Multimedia             Photos \u0026 Multimedia      Photos          Haleakal? Crater NPS Photo  Summit District        Lower ?Ohe?o Stream J. Frost/ NPS Photo  K?pahulu District       Multimedia            Endangered Wildlife   Watch videos of the ?ua?u and n?n?.         ?Ua?u calling in the night Listen to the sounds of our endangered seabird, ?Ua?u, at the top of Haleakal?.           Cultural Demonstrations Watch videos of cultural demonstrations in the K?pahulu District.                      Flash Flood Footage Check out this incredible flash flood footage from Maka\u0027alae in Hana, near Kipahulu.   Duration:3 minutes, 50 seconds                              We Can Plant a Forest performed by the Seabury Hall 6th Grade Chorus Maui Middle School Chorus sings for ??National Park Week? with a Jr. Ranger Day Tribute to CCC member Uncle Rex and Haleakal? National Park. The 6th Grade Chorus from Seabury Hall, a school on the slopes of Haleakal?, celebrating their own half century of education here in Hawai\u0027i, offered this heart felt tribute to one of Maui\u0027s own, Uncle Rex of the Civilian Conservation Corps also known as Roosevelt\u0027s Tree Army.  Duration:3 minutes, 51 seconds                              The Dependable Mules of Haleakal? Seabury Hall Middle School produced a short film on the continuing use of pack mules at Haleakal? National Park, which aired on PBS Hawaii\u0027s HIKI N? television program in April of 2016.   Duration:3 minutes, 10 seconds                              Lokelani Intermediate School Youth Stewards Students from Lokelani Intermediate School in Kihei visited Haleakal? National Park to learn about biodiversity and to volunteer as youth stewards to help eradicate non-native species.  Duration:2 minutes, 16 seconds                Social Media and Blogs        Olelo Ola (Living Words)- Haleakela National Park is proud to bring you social media centered around the legacy, culture, and environment of the Islands.       Haleakal? National Park is now on Facebook! Click here to visit our Facebook page.          Haleakal? National Park is now on Twitter! Click here to visit our Twitter page.","title":"Haleakal? National Park: Photos \u0026 Multimedia","url":"https://www.nps.gov/hale/learn/photosmultimedia/index.htm"}